#მოცემულ ექვს ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ 3-3 მაგალითი

print(1+5)
print(9+4)
print(4+7)

print(10-5)
print(7-2)
print(6-1)

print(10/2)
print(10/5)
print(20/5)

print(5*6)
print(4*8)
print(3*4)

print(10%3)
print(10&6)
print(15%7)

print(7**2)
print(5**3)
print(4**2)


#შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს.
#შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ წინა ცვლადის ტემპერატურა ფარენჰეიტში რამდენი იქნება.

celsius=23
Fahrenheit=80

print(celsius*9/5+32)


#შექმენით თქვენი ოჯახის წევრების ასაკებისგან ცვლადები,
#დააფდეითეთ მათი მნიშვნელობები ახალ ცვლადებში - დაუწერეთ 20 წლის შემდეგ რა იქნება და დაპრინტეთ ახალი ცვლადების მნიშვნელობები.


mom = 43 + 20
dad = 44 + 20
myself = 15 + 20 

print(mom)
print(dad)
print(myself)

