#შექმენით ფუნქცია სახელად greet, რომელსაც ექნება 1 პარამეტრი. ფუნქციის გამოძახებისას არგუმენტად გადაეცით თქვენი სახელი და ფუნქციამ ასეთი რამ უნდა დაგიბეჭდოთ: 
# "გამარჯობა, {აქ თქვენი სახელი}"

def greet (name):
    print("გამარჯობა", name)

greet("გიორგი")


# საკლასო დავალება: შექმენით ფუნქცია სახელად manual_range, რომელსაც გადაეცემა სამი პარამეტრი (start, end, step).

# ფუნქციის დავალებაა რომ გადაცემული პარამეტრებით შეადგინოს დიაპაზონი, შემდეგ ამ დიაპაზონს გადავუაროთ ციკლით და დავბეჭდოთ მხოლოდ ლუწი რიცხვები.

# ფუნქციის გამოძახებისას მას აუცილებლად უნდა გადაეცეს 3 არგუმენტი.

# ფუნქცია გამოიძახეთ მინიმუმ 5-ჯერ სხვადასხვა არგუმენტებით

def manual_range(start,end,step):
    diapason= range(start,end,step)

    for i in diapason:
        if i % 2 == 0:
            print(i)

manual_range(300,63,26)
manual_range(32,645,85)
manual_range(723,95,41)
manual_range(103,205,231)
manual_range(136,168,124)

# საკლასო დავალება: შექმენით ფუნქცია სახელად manual_len, რომელსაც ექნება გაწერილი 1 პარამეტრი.

# ფუნქციას გადაეცემა სია და მისი დავალებაა რომ დააბრუნოს სიის სიგრძე (len არ გამოიყენოთ). უნდა გამოიყენოთ for ან while ციკლი და ერთი ცვლადი. საბოლოოდ დაბეჭდეთ სიის სიგრძე.

# ფუნქციის გამოძახებისას გადაეცემა მას ერთი არგუმენტი - სია


def manual_len(list):
    length = 0
    while list[length:]:
        length += 1
        print("სიის სიგრძე არის:", length)

my_list = [1, 2, 3, 4, 5]
manual_len(my_list)