#2) იმუშავეთ ლოგიკურ ოპერაციებზე: print ბრძანებას გადაეცით 2 ან 3 ბულეანი და ისინი ერთმანეთთან დააკავშირეთ ლოგიკური ოპერატორებით (or / and)

print(True and False or True)


#3) print ბრძანების გამოყენებით ჩამოწერეთ 10 ისეთი მაგალითი, სადაც გაერთიანებული გექნებათ შედარების ოპერაციები და ლოგიკური ოპერაციები. 
# კარგი იქნება ცვლადებსაც თუ გამოიყენებთ და მათში შეინახავთ ბულეანებს ან სხვა მონაცემთა ტიპებს

#1
ცვლადი=True
შედარების=10>5

print(ცვლადი and შედარების)

#2
print(True and 9<3 or False)


#3
print(True or True and 20>19)

#4

ცვლადი=False
ცვლადი1=True
შედარების=15>14
შედარების1=15<3

print(ცვლადი and ცვლადი1 or შედარების and შედარების)


#5
print(True or False)

#6
print(10>3 and 23>3)

#7 
print(True or False and True)

#8
ცვლადი=False
შედარების=27<28
შედარების1=13>53
print(ცვლადი or შედარების1 > შედარების1)

#9
print(True or False and True)

#10
ცვლადი=True
ცვლადი1=False
print(True or False)